date_text = input("введите дату рождения в формате дд.мм.гггг: ")

parts = date_text.split(".")
day = int(parts[0])
month = int(parts[1])
signs = [
    (20, "козерог", "водолей"),
    (19, "водолей", "рыбы"),
    (21, "рыбы", "овен"),   
    (20, "овен", "телец"),        
    (21, "телец", "близнецы"),
    (21, "близнецы", "рак"),
    (23, "рак", "лев"),      
    (23, "лев", "дева"), 
    (23, "дева", "весы"),
    (23, "весы", "скорпион"),   
    (23, "скорпион", "стрелец"), 
    (22, "стрелец", "козерог"),  
]

border_day = signs[month - 1][0]
if day < border_day:
    zodiac = signs[month - 1][1]
else:
    zodiac = signs[month - 1][2]

print(f"дата рождения: {date_text}")
print(f"ваш знак зодиака: {zodiac}")
