a = float(input("введите число a: "))
b = float(input("введите число b: "))

print(f"сумма a и b: {a + b}")
print(f"разность a и b: {a - b}")
print(f"произведение a и b: {a * b}")

if b == 0:
    print("частное a и b: деление на ноль невозможно")
    print("остаток от деления a на b: деление на ноль невозможно")
else:
    print(f"частное a и b: {a / b}")
    print(f"остаток от деления a на b: {a % b}")

if a == 0 and b < 0:
    print("результат a в степени b: деление на ноль невозможно")
else:
    print(f"результат a в степени b: {a ** b}")
